In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[1, 2, 3, 4],
                   [2, np.nan, 4, 5], 
                   [3, 4, 5, 6]], index=list('가나다'), columns=list('ABCD'))
df

   A    B  C  D
가  1  2.0  3  4
나  2  NaN  4  5
다  3  4.0  5  6

In [4]:
df.sum(axis=0)

A     6.0
B     6.0
C    12.0
D    15.0
dtype: float64

In [5]:
df.sum(axis=1)

가    10.0
나    11.0
다    18.0
dtype: float64

In [6]:
df.dropna(axis=0, how='any')

   A    B  C  D
가  1  2.0  3  4
다  3  4.0  5  6

In [7]:
df.dropna(axis=1, how='any')

   A  C  D
가  1  3  4
나  2  4  5
다  3  5  6

In [13]:
df.apply(lambda x: sum(x), axis=0)

A     6.0
B     NaN
C    12.0
D    15.0
dtype: float64

In [14]:
df.apply(lambda x: sum(x), axis=1)

가    10.0
나     NaN
다    18.0
dtype: float64